Project/Toir/src/DataProcessors/торо_ПанельАдминистрированияТОиР/торо_ПанельАдминистрированияТОиР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_ПанельАдминистрированияТОиР</name>
</mdclass:DataProcessor>

Project/Toir/src/Catalogs/торо_ЗаявкаНаРемонтПрисоединенныеФайлы/торо_ЗаявкаНаРемонтПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ЗаявкаНаРемонтПрисоединенныеФайлы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске (в случае если Тип хранения файла - на диске)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <comment>Размер файла</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <comment>Текст, извлеченный из файла - для полнотекстового поиска</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <comment>Где хранятся файлы - в базе как Хранилище значения или в каталоге на диске</comment>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <comment>Ссылка на том (в случае если Тип хранения файла - на диске)</comment>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <comment>Служебное поле для обмена файлами в распределенной информационной базе</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ИДГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьЭлектронныеПодписи</name>
    <attributes>
      <name>ДатаПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомуВыданСертификат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отпечаток</name>
      <comment>Отпечаток сертификата</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановившийПодпись</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроверкиПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодписьВерна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьСертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/DataProcessors/торо_ПанельАдминистрированияТОиР/Forms/ФормаНастройкиИерархииФайлов/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МассивРодителей = Новый Массив();
	МассивРодителей.Добавить(Справочники.торо_ЗаявкаНаРемонтПрисоединенныеФайлы.ПустаяСсылка());
	МассивВетвей = Новый Массив();
	//
	Корень = ДеревоГрупп.ПолучитьЭлементы();
	Корень.Очистить();
	НС = Корень.Добавить();
	НС.НаименованиеНовое = "Иерархия групп";
	НС.Служебный = Истина;
	Корень = НС.ПОлучитьЭлементы();
	
	Пока МассивРодителей.Количество() Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	торо_ЗаявкаНаРемонтПрисоединенныеФайлы.Родитель КАК Родитель,
			|	торо_ЗаявкаНаРемонтПрисоединенныеФайлы.Ссылка КАК Ссылка,
			|	торо_ЗаявкаНаРемонтПрисоединенныеФайлы.Наименование КАК Наименование,
			|	торо_ЗаявкаНаРемонтПрисоединенныеФайлы.Родитель.Наименование КАК РодительНаименование,
			|	торо_ЗаявкаНаРемонтПрисоединенныеФайлы.ПометкаУдаления КАК ПометкаУдаления,
			|	торо_ЗаявкаНаРемонтПрисоединенныеФайлы.гкс_ИДГруппы КАК гкс_ИДГруппы
			|ИЗ
			|	Справочник.торо_ЗаявкаНаРемонтПрисоединенныеФайлы КАК торо_ЗаявкаНаРемонтПрисоединенныеФайлы
			|ГДЕ
			|	торо_ЗаявкаНаРемонтПрисоединенныеФайлы.ЭтоГруппа = ИСТИНА
			|	И НЕ торо_ЗаявкаНаРемонтПрисоединенныеФайлы.гкс_ИДГруппы = """"
			|	И торо_ЗаявкаНаРемонтПрисоединенныеФайлы.Родитель В(&Ссылка)";
		Запрос.УстановитьПараметр("Ссылка",МассивРодителей);
		ВременныйМассив1 = Новый Массив();
		ВременныйМассив2 = Новый Массив();
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если МассивВетвей.Количество() = 0 Тогда 
				НС = Корень.Добавить();
				ЗаполнитьЗначенияСвойств(НС,Выборка);
				НС.Ссылка = Выборка.Ссылка;
				НС.Наименование = Выборка.Наименование;
				НС.НаименованиеНовое = Выборка.Наименование;
				НС.Родитель = Выборка.РодительНаименование;
				//
				ВременныйМассив1.Добавить(НС);
				ВременныйМассив2.Добавить(Выборка.Ссылка);
			Иначе
				Для Каждого СМ Из МассивВетвей Цикл
					Если СМ.Ссылка = Выборка.Родитель Тогда 
						НС = СМ.ПОлучитьЭлементы().Добавить();
						ЗаполнитьЗначенияСвойств(НС,Выборка);
						НС.Ссылка = Выборка.Ссылка;
						НС.Наименование = Выборка.Наименование;
						НС.НаименованиеНовое = Выборка.Наименование;
						НС.Родитель = Выборка.РодительНаименование;
						//
						ВременныйМассив1.Добавить(НС);
						ВременныйМассив2.Добавить(Выборка.Ссылка);
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			//
		КонецЦикла;
		МассивРодителей = ВременныйМассив2;
		МассивВетвей = ВременныйМассив1;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПересоздатьИерархиюНаСервере()
	ТЧ = Новый ТаблицаЗначений();
	ТЧ.Колонки.Добавить("гкс_ИДГруппы",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
	ТЧ.Колонки.Добавить("гкс_ИДГруппы_Родитель",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
	ТЧ.Колонки.Добавить("Наименование",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150)));
	ТЧ.Колонки.Добавить("НаименованиеНовое",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150)));
	ТЧ.Колонки.Добавить("ПометкаУдаления",Новый ОписаниеТипов("Булево"));
	
	ПройтиПОВетви(ДеревоГрупп.ПолучитьЭлементы(),ТЧ);
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЧ.Наименование КАК Наименование,
	               |	ТЧ.гкс_ИДГруппы КАК гкс_ИДГруппы,
	               |	ТЧ.гкс_ИДГруппы_Родитель КАК гкс_ИДГруппы_Родитель,
	               |	ТЧ.НаименованиеНовое КАК НаименованиеНовое,
	               |	ТЧ.ПометкаУдаления КАК ПометкаУдаления
	               |ПОМЕСТИТЬ Исходная
	               |ИЗ
	               |	&ТЧ КАК ТЧ";
   	Запрос.УстановитьПараметр("ТЧ",ТЧ);
	Запрос.Выполнить();
	
	МассивСправочников = Новый Массив();
	МассивСправочников.Добавить("торо_ЗаявкаНаРемонтПрисоединенныеФайлы");
	МассивСправочников.Добавить("торо_ВнешнееОснованиеДляРаботПрисоединенныеФайлы");
	МассивСправочников.Добавить("торо_ВыбытиеОбъектаРемонтаПрисоединенныеФайлы");
	МассивСправочников.Добавить("торо_ВыявленныеДефектыПрисоединенныеФайлы");
	МассивСправочников.Добавить("торо_ГрафикРегламентныхМероприятийТОиРПрисоединенныеФайлы");
	МассивСправочников.Добавить("торо_НарядНаВыполнениеРемонтныхРаботПрисоединенныеФайлы");
	МассивСправочников.Добавить("торо_НарядНаРегламентноеМероприятиеПрисоединенныеФайлы");
	МассивСправочников.Добавить("торо_ОбъектыРемонтаПрисоединенныеФайлы");
	МассивСправочников.Добавить("торо_ПланГрафикРемонтаПрисоединенныеФайлы");
	МассивСправочников.Добавить("торо_ПринятиеОРКУчетуПрисоединенныеФайлы");
	МассивСправочников.Добавить("торо_СостоянияОбъектовРемонтаПрисоединенныеФайлы");
	МассивСправочников.Добавить("торо_УчетКонтролируемыхПоказателейПрисоединенныеФайлы");
	МассивСправочников.Добавить("торо_УчетНаработкиОборудованияПрисоединенныеФайлы");
	МассивСправочников.Добавить("торо_ТехКартыПрисоединенныеФайлы");
	МассивСправочников.Добавить("торо_ТиповыеОРПрисоединенныеФайлы");
	МассивСправочников.Добавить("торо_АктОВыполненииРегламентногоМероприятияПрисоединенныеФайлы");
	МассивСправочников.Добавить("торо_АктОВыполненииЭтапаРаботПрисоединенныеФайлы");
	МассивСправочников.Добавить("торо_АктПриемкиОборудованияПрисоединенныеФайлы");
	Для Каждого ИмяСправочника Из МассивСправочников Цикл
		Запрос.Текст =  
		"ВЫБРАТЬ
		|	торо_ЗаявкаНаРемонтПрисоединенныеФайлы.Ссылка КАК Ссылка,
		|	Исходная.НаименованиеНовое КАК НаименованиеНовое,
		|	Родители.Ссылка КАК Родитель,
		|	Исходная.ПометкаУдаления КАК ПометкаУдаления,
		|	Исходная.гкс_ИДГруппы_Родитель КАК РодительНаименование,
		|	Исходная.гкс_ИДГруппы КАК гкс_ИДГруппы
		|ИЗ
		|	Исходная КАК Исходная
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник."+ИмяСправочника+" КАК Родители
		|		ПО (Родители.гкс_ИДГруппы = Исходная.гкс_ИДГруппы_Родитель)
		|			И (НЕ Исходная.гкс_ИДГруппы_Родитель = """")
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник."+ИмяСправочника+" КАК торо_ЗаявкаНаРемонтПрисоединенныеФайлы
		|		ПО (торо_ЗаявкаНаРемонтПрисоединенныеФайлы.гкс_ИДГруппы = Исходная.гкс_ИДГруппы)
		|";
		
		МассивДляПерезаписи = Новый Массив();
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда 
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда 
					ТекОбъект = Выборка.Ссылка.ПолучитьОбъект();
				Иначе
					Если Выборка.ПометкаУдаления Тогда 
						Продолжить;
					КонецЕсли;
					ТекОбъект = Справочники[ИмяСправочника].СоздатьГруппу();
					ТекОбъект.ДатаСоздания = ТекущаяДата();
					ТекОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
					ТекОбъект.гкс_ИДГруппы = Выборка.гкс_ИДГруппы;
				КонецЕсли;
				Если НЕ ТекОбъект.Наименование = Выборка.НаименованиеНовое ИЛИ
					НЕ ТекОбъект.Родитель = Выборка.Родитель Тогда 
					ТекОбъект.Наименование = Выборка.НаименованиеНовое;
					ТекОбъект.Родитель = Выборка.Родитель;
					ТекОбъект.Изменил = ПараметрыСеанса.ТекущийПользователь;
					ТекОбъект.ДатаМодификацииУниверсальная = ТекущаяДата();
					ТекОбъект.Записать();
					Если ЗначениеЗаполнено(Выборка.Родитель) = Ложь И ЗначениеЗаполнено(Выборка.РодительНаименование) = Истина Тогда
						МассивДляПерезаписи.Добавить(ТекОбъект.Ссылка);
					КонецЕсли;
				КонецЕсли;
				Если НЕ ТекОбъект.ПометкаУдаления = Выборка.ПометкаУдаления Тогда 
					ТекОбъект.УстановитьПометкуУдаления(Выборка.ПометкаУдаления);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		//
		Если МассивДляПерезаписи.Количество() > 0 Тогда 
			Запрос.Текст =  
			"ВЫБРАТЬ
			|	торо_ЗаявкаНаРемонтПрисоединенныеФайлы.Ссылка КАК Ссылка,
			|	Родители.Ссылка КАК Родитель
			|ИЗ
			|	Исходная КАК Исходная
			|		Внутреннее СОЕДИНЕНИЕ Справочник."+ИмяСправочника+" КАК Родители
			|		ПО (Родители.гкс_ИДГруппы = Исходная.гкс_ИДГруппы_Родитель)
			|			И (НЕ Исходная.гкс_ИДГруппы_Родитель = """")
			|		Внутреннее СОЕДИНЕНИЕ Справочник."+ИмяСправочника+" КАК торо_ЗаявкаНаРемонтПрисоединенныеФайлы
			|		ПО (торо_ЗаявкаНаРемонтПрисоединенныеФайлы.гкс_ИДГруппы = Исходная.гкс_ИДГруппы)
			|	И торо_ЗаявкаНаРемонтПрисоединенныеФайлы.Ссылка В (&Ссылки)
			|";
			Запрос.УстановитьПараметр("Ссылки",МассивДляПерезаписи);
			РезультатЗапроса = Запрос.Выполнить();
			Если Не РезультатЗапроса.Пустой() Тогда 
				Выборка = РезультатЗапроса.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда 
						ТекОбъект = Выборка.Ссылка.ПолучитьОбъект();
						ТекОбъект.Родитель = Выборка.Родитель;
						ТекОбъект.Записать();
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПересоздатьИерархию(Команда)
	ПересоздатьИерархиюНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПройтиПОВетви(Ветвь, ТЧ, ИмяРодителя = "")
	Для Каждого ТекСтрока Из Ветвь Цикл
		Если ТекСтрока.Служебный = Ложь Тогда 
			Если ЗначениеЗаполнено(ТекСтрока.гкс_ИДГруппы) Тогда 
				НС = ТЧ.Добавить();
				ЗаполнитьЗначенияСвойств(НС,ТекСтрока);
				НС.гкс_ИДГруппы_Родитель = ИмяРодителя;
			КонецЕсли;
		КонецЕсли;
		//
		ПройтиПОВетви(ТекСтрока.ПолучитьЭлементы(), ТЧ, ТекСтрока.гкс_ИДГруппы);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоГруппПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	ТекДанные = Элементы.ДеревоГрупп.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		Если ТекДанные.Служебный = Ложь Тогда 
			ТекДанные.ПометкаУдаления = НЕ ТекДанные.ПометкаУдаления;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоГруппПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
	НовыйКорень = ДеревоГрупп.НайтиПоИдентификатору(Строка);
	Перетаскиваемый = ДеревоГрупп.НайтиПоИдентификатору(ПараметрыПеретаскивания.Значение);
	
	Если НайтиРодителяВДереве(НовыйКорень,Перетаскиваемый) Тогда 
		Возврат;
	КонецЕсли;
	
	КопироватьВетвь(НовыйКорень.ПолучитьЭлементы(),Перетаскиваемый);
	Родитель = Перетаскиваемый.ПолучитьРодителя();
	Родитель.ПолучитьЭлементы().Удалить(Перетаскиваемый);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоГруппНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	ТекДанные = Элементы.ДеревоГрупп.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		Если ТекДанные.Служебный = Истина Тогда 
			Выполнение = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КопироватьВетвь(НовыйРодитель, Копируемый)
	НС = НовыйРодитель.Добавить();
	ЗаполнитьЗначенияСвойств(НС,Копируемый);
	Ветвь = Копируемый.ПолучитьЭлементы();
	НоваяВетвь = НС.ПолучитьЭлементы();
	Для Каждого СМ Из Ветвь Цикл
		КопироватьВетвь(НоваяВетвь,СМ);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция НайтиРодителяВДереве(ГдеИскать, ЧтоИскать)
	Родитель = ГдеИскать.ПолучитьРодителя();
	Если Родитель = Неопределено Тогда 
		Возврат Ложь;
	ИначеЕсли Родитель = ЧтоИскать Тогда 
		Возврат Истина;
	Иначе
		Возврат НайтиРодителяВДереве(Родитель, ЧтоИскать);
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ДеревоГруппПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекДанные = Элементы.ДеревоГрупп.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		Если ТекДанные.Служебный = Ложь И ЗначениеЗаполнено(ТекДанные.гкс_ИДГруппы) = Ложь Тогда 
			ТекДанные.гкс_ИДГруппы = Строка(Новый УникальныйИдентификатор());
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
